import { AditionalInfo } from 'components/AditionalInfo/AditionalInfo';
import { Footer } from 'components/Footer/Footer';
import {
  ChapterContainer,
  ChapterText,
} from 'components/History/History.styled';

import { SectionContent } from 'components/Templates/SectionContent/SectionContent';
import { SectionTitle } from 'components/Templates/SectionTitle/SectionTitle';
import { Title } from 'components/Templates/Title/Title';
import { Wrap } from 'components/Templates/Wrap/Wrap';
import { TitleDescription } from 'components/Templates/TitleDescription/TitleDescription';
import { Article } from 'components/Templates/Article/Article';

const data = [
  {
    title: 'Створення (1974-1976)',
    info: `Кафедра АСУ була створена в 1974 році на основі групи
                  викладачів кафедри «Інформаційно-вимірювальна техніка» та
                  розміщена на 8-му поверсі щойно введеного в експлуатацію 5-го
                  навчального корпусу. Набір — 100 студентів річно. Перший
                  штатний розпис кафедри включав лише 5 осіб: завідувач кафедри,
                  доцент, к. т. н. Огородник І.М., старший викладач, к.т.н.
                  Марунчак Д.Є. та асистенти Обельовська К.М., Струк М.І.,
                  Ткаченко Р.О.`,
  },
  {
    title: '1982–1992',
    info: `З 1982 до 1992 року кафедрою завідував доцент Фабрі Л.П. Продовжувалося
     формування колективу кафедри, були захищені перші кандидатські дисертації, зміцнилися
     взаємовигідні зв'язки із провідними підприємствами та академічними установами
     Львова, значно розширилася госпдоговірна тематика. Розвинулися нові напрямки
     наукових досліджень — методи і засоби обробки мовних сигналів та автоматизація
     проектування банків і баз даних. Розпочалася підготовка фахівців за спеціалізацією
     «Автоматизовані системи наукових досліджень та комплексних випробувань».`,
  },
  {
    title: '1992–2011',
    info: [
      `З 1992 року до 2011 року завідувачем кафедри був її випускник
        1977 року, доктор технічних наук, професор Рашкевич Ю.М.
        Протягом 1992-1994 років проведені організаційні та методичні
        заходи, пов’язані з переходом на багаторівневу (бакалавр,
        спеціаліст, магістр) систему підготовки фахівців. Кафедра
        тричі в 1993, 1998 та 2003 роках пройшла державну акредитацію
        на найвищий — четвертий рівень, розпочата підготовка іноземних
        спеціалістів та аспірантів на контрактній основі, суттєво
        покращена матеріальна та методична база для проведення
        навчального процесу. В рамках бакалаврату «Комп’ютерні науки»
        створена нова спеціальність «Технологія автоматизованої
        обробки текстової та графічної інформації». Розширився спектр
        наукових досліджень — теорія оптимальних комбінаторних
        структур, нейронні мережі та адаптивні системи, спеціалізовані
        засоби цифрової обробки сигналів, захищені п’ять докторських
        та понад 10 кандидатських дисертацій. На базі кафедри створена
        спеціалізована вчена рада К 35.052.14 з правом прийняття до
        розгляду та проведення захисту дисертацій на здобуття
        наукового ступеня кандидата технічних наук за спеціальностями
        05.13.03 «Системи та процеси керування» та 01.05.04 «Системний
        аналіз та теорія оптимальних рішень». В 1998 році розпочато
        підготовку бакалаврів за новим напрямком «Легка промисловість»
        із спеціальністю «Видавничо-поліграфічна справа». В 2011 році
        ця спеціальність виділилась в окрему кафедру ІТВС
        (інформаційні технології у видавничій справі).`,
      ` Проведене переоснащення лабораторій кафедри сучасною технікою,
         створена розгалужена загальнокафедеральна комп'ютерна мережа з
         доступом до глобальної мережі Internet, регулярно оновлюється
         методичне забезпечення, вдосконалюються технології навчання. В
         2000 році на кафедрі успішно виконаний проект за програмою
         TEMPUS/TACIS, в рамках якого створений на базі кафедри
         загальнодержавний Центр підвищення кваліфікації викладачів в
         області використання сучасних інформаційних технологій в
         навчальному процесі, розроблена та впроваджена сучасна система
         організації та управління навчальним процесом.`,
    ],
  },
  {
    title: '2011–2021',
    info: [
      `З 2011 до 2015 року кафедрою керував доктор технічних наук,
                професор Медиковський Микола Олександрович. На той час
                науково-педагогічний колектив, кафедри складали 5 докторів та 23
                кандидати наук.`,
      `З 2015 по 2021 рік кафедру очолював доктор технічних наук,
                професор Цмоць Іван Григорович.`,
      `Викладацький склад кафедри АСУ вже налічує 45 працівників.
                Підготовку кадрів здійснює висококваліфікований
                науково-педагогічний колектив, до складу якого входять 5
                професорів, 6 докторів наук, 16 доцентів, 4 старших викладачів,
                11 асистентів, серед яких 22 кандидати наук. Кафедра щорічно
                публікує понад 70 наукових статей, виконуються наукові роботи на
                замовлення ДКНТ, Міністерства освіти та за госпдоговірною
                тематикою, налагоджене міжнародне науково-технічне
                співробітництво, діє аспірантура та докторантура. Видано 4
                монографії.`,
    ],
  },
  {
    title: 'Актуальна інформація',
    info: [
      `Кафедра АСУ готує фахівців освітньо-кваліфікаційного рівнів
                «бакалавр» та «магістр» за спеціальностями 122 «Комп’ютерні
                науки».`,
      `За понад 45 років існування кафедрою підготовлено понад 5000
                спеціалістів; з них понад 4500 випускників стаціонарної форми
                навчання і понад 500 вечірньої та заочної, зокрема 160 іноземних
                інженерів і магістрів (для Алжиру, Бангладеш, Болгарії,
                В’єтнаму, Китаю, Конго, Куби, Лівану, Монголії, Непалу,
                Німеччини, Польщі, Таджикистану, Чехословаччини, Шрі-Ланки,
                Тунісу та Сирії). Підготовлені та захищені 2 дисертації
                випускників з Тунісу.`,
      `Кафедра веде співпрацю з рядом
                закордонних вищих навчальних закладів — Торонтонським університетом (Канада),
                 Університетами прикладних наук Цвіккау та Нюрнберга (ФРН), Університетом
                   Твенте (Нідерланди), Віденським технічним університетом (Австрія),
                 Політехнікою Вроцлавською та Жешівським університетом (Польща).Впродовж
                 декількох останніх років діє домовленість з Кінгстонским університетом В
                 Лондоні для стажування студентів і викладачів в області комп'ютерних наук.
                 Спільно проведені дослідження та підготовлені проекти вказують на належне
                  високе місце кафедри у світовій науково-педагогічній спільноті. `,
      `У січні 2021 року кафедру очолив професор, д.т.н. Теслюк Василь
                Миколайович. Викладацький склад кафедри налічує понад 50
                працівників серед яких 10 професорів, 13 докторів наук, 17
                доцентів, 3 старших викладачі, 16 асистентів, серед яких 25
                кандидатів наук та 11 аспірантів.`,
    ],
  },
];

export const History = () => {
  return (
    <>
      <main>
        <SectionTitle>
          <Wrap>
            <Title variant="h1" textAlign={[null, 'center']} mb={[3, 6]}>
              Історія_кафедри
            </Title>
            <TitleDescription textAlign={[null, 'center']}>
              Історія кафедри автоматизованих систем управління
            </TitleDescription>
          </Wrap>
        </SectionTitle>
        <SectionContent>
          <Wrap
            p={[null, 11]}
            px={[6, null]}
            maxWidth={[null, '980px']}
            boxShadow="regular"
          >
            <ul>
              {data.map(({ title, info }, index) => (
                <ChapterContainer key={index}>
                  <Title variant="h2" pb={[2, 6]} mb={8} borderBottom="titles">
                    {title}
                  </Title>

                  {Array.isArray(info) ? (
                    <ul>
                      {info.map((info, index) => (
                        <ChapterText key={index}>
                          <Article>{info}</Article>
                        </ChapterText>
                      ))}
                    </ul>
                  ) : (
                    <Article>{info}</Article>
                  )}
                </ChapterContainer>
              ))}
            </ul>
            <AditionalInfo />
          </Wrap>
        </SectionContent>
      </main>

      <Footer />
    </>
  );
};
