import { Footer } from 'components/Footer/Footer';

import {
  About,
  Button,
  ImgContainer,
  Section,
  SectionTitle,
  Title,
  Wrap,
  Img,
  LogoContainer,
  Logo,
  DescriptonContainer,
  ImgLink,
  ImgTitle,
  Wrapper,
} from 'components/PartnershipDetail/PartnershipDetail.styled';

import img from '../image/univer.png';
import logo from '../image/univlogo.png';

const data = [
  {
    id: 1,
    title: 'Сілезький технологічний університет',

    tag: [
      { id: 1444, text: 'Сілезький університет', href: '' },
      { id: 24444, text: 'Жешувський університет', href: '' },
    ],
    info: [
      {
        id: 133,
        img: img,
        title: 'Сілезький технологічний університет',
        logo: logo,
        href: '',
        link: 'https://silen.edu',
        detail: [
          {
            id: 144,
            title: 'Програма обміну',
            text: 'Програма обміну включала двосеместрове стипендіальне навчання студентів спеціальності “Інформаційні управляючі системи та технології” на факультеті автоматики, електроніки та комп’ютерних наук Сілезького політехнічного університету. На навчання у Сілезький університет двічі скеровувалися групи з п’ятьох студентів-магістрів кафедри АСУ Львівської політехніки. До першої п’ятірки потрапили Арсен Заграй, Сергій Батюк, Уляна Поліщук, Мирон Мавко та Сергій Криницький. До другої групи – Сергій Пилипчук, Дмитро Санду, Марта Машевська, Олександр Фесенко, Ірина Марецька. Своєю чергою, викладачі Сілезького університету упродовж двох місяців обмінювались науковим та освітнім досвідом у стінах Львівської політехніки.',
          },
          {
            id: 223,
            title: 'Навчання',
            text: [
              {
                id: 112,
                text: 'Навчання в університеті проводилось англійською мовою. Серед дисциплін, які вивчали студенти кафедри, були: паралельне програмування, Java і програмування в Інтернеті, робототехніка, безпровідні комп’ютерні мережі, промислові мережі та бази даних, комп’ютерний зір та біометричні системи, адаптивні управляючі системи, сенсори та активатори, програмні засоби управління та інші. Важливою роль для підвищення ефективності навчального процесу відігравала практична підготовка. Наявність сучасного обладнання та програмних засобів забезпечувала максимальне наближення навчальних завдань до реальних прикладних задач.',
              },
              {
                id: 231213,
                text: 'Після закінчення усі випускники отримали сертифікат про закінчення курсу та змогу продовжити навчання для отримання диплому Сілезького університету. Четверо студентів: А. Заграй, Д. Санду, О. Фесенко та І. Марецька скористалися цією нагодою та паралельно із захистом магістерських робіт у рідній Львівській політехніці продовжили навчання у Польщі та отримали звання і дипломи магістрів Сілезького політехнічного університету.',
              },
            ],
          },
        ],
      },
    ],
  },
];

export const PartnershipDetail = () => {
  const { title, tag, info } = data[0];
  console.log('tag', tag);
  const onClick = link => {
    window.location.href = `${link}`;
  };
  return (
    <>
      <main>
        <SectionTitle>
          <Title>{title}</Title>
          <Wrap>
            {tag.map(({ text, id, href }) => {
              return (
                <Button
                  type="button"
                  onClick={() => {
                    onClick(href);
                  }}
                  key={id}
                >
                  {text}
                </Button>
              );
            })}
          </Wrap>
        </SectionTitle>
        <Section>
          {info.map(({ id, img, title, logo, href, detail, link }) => {
            return (
              <About key={id}>
                <ImgContainer>
                  <Img src={img} alt="" />
                  <LogoContainer>
                    <Logo src={logo} alt="" />
                  </LogoContainer>
                  <DescriptonContainer>
                    <Wrapper>
                    <ImgTitle>{title}</ImgTitle>
                      <ImgLink href={link}>{link}</ImgLink>
                    </Wrapper>
                  </DescriptonContainer>
                </ImgContainer>
              </About>
            );
          })}
        </Section>
      </main>
      <Footer />
    </>
  );
};
