import { AditionalInfo } from "components/AditionalInfo/AditionalInfo";
import { Box } from "components/Box";
import { Text } from "components/Templates/Article/Text";

import { List } from "./NewsDetail.styled";


export const About = () => {
    return (
      <Box maxWidth="960px" m="0 auto" p="48px" mb="128px">
        <Box mb="64px">
          <Text margin>
            Запрошуємо майбутніх абітурієнтів на День відкритих дверей, який
            відбудеться у суботу, 14 березня, в аудиторії 217 головного корпусу
            Університету. Початок о 11:00.
          </Text>
          <Text margin>
            Дирекція Інституту й представники кафедр ознайомлять гостей з
            особливостями вступу на бакалаврський та магістерський рівні вищої
            освіти, розкажуть про навчання за скороченим терміном, дуальну форму
            навчання, можливість здобути другу вищу освіту та паралельне
            навчання студентів спеціальностей:
          </Text>
          <List mb>
            <li>
              <Text>035 «Філологія»;</Text>
            </li>
            <li>
              <Text>121 «Інженерія програмного забезпечення»;</Text>
            </li>
            <li>
              <Text>122 «Комп’ютерні науки»;</Text>
            </li>
            <li>
              <Text>124 «Системний аналіз»;</Text>
            </li>
            <li>
              <Text>126 «Інформаційні системи та технології»;</Text>
            </li>
          </List>
          <Text margin>Програма:</Text>
          <List>
            <li>
              <Text>
                Інформація про Національний університет «Львівська політехніка»,
                ІКНІ та зміст освіти за спеціальностями;
              </Text>
            </li>
            <li>
              <Text>Аналіз правил прийому до Університету у 2020 році;</Text>
            </li>
            <li>
              <Text>
                Спілкування із представниками ІТ-компаній та студентами;
              </Text>
            </li>
            <li>
              <Text>
                Огляд виставки розробок студентів та викладачів кафедр;
              </Text>
            </li>
            <li>
              <Text>Знайомство з умовами навчання на кафедрах.</Text>
            </li>
          </List>
        </Box>
        <AditionalInfo />
      </Box>
    );
}